hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_CMD_ID_FUNC_INFO                                                0x10
//FUNC_INFO ARGS
#define SI446X_CMD_ARG_COUNT_FUNC_INFO                                         1
//FUNC_INFO REPLY
#define SI446X_CMD_REPLY_COUNT_FUNC_INFO                                       6
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_TYPE u8
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_SIZE 8
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_MASK 0xFF
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_MSB  7
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_LSB  0
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_INDEX 1
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_MIN 0
    #define SI446X_CMD_FUNC_INFO_REP_REVEXT_MAX 255
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_TYPE u8
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_SIZE 8
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_MASK 0xFF
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_MSB  7
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_LSB  0
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_INDEX 2
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_MIN 0
    #define SI446X_CMD_FUNC_INFO_REP_REVBRANCH_MAX 255
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_TYPE u8
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_SIZE 8
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_MASK 0xFF
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_MSB  7
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_LSB  0
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_INDEX 3
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_MIN 0
    #define SI446X_CMD_FUNC_INFO_REP_REVINT_MAX 255
    #define SI446X_CMD_FUNC_INFO_REP_PATCH_TYPE u16
    #define SI446X_CMD_FUNC_INFO_REP_PATCH_SIZE 16
    #define SI446X_CMD_FUNC_INFO_REP_PATCH_MASK 0xFFFF
    #define SI446X_CMD_FUNC_INFO_REP_PATCH_MSB  15
    #define SI446X_CMD_FUNC_INFO_REP_PATCH_LSB  0
    #define SI446X_CMD_FUNC_INFO_REP_PATCH_INDEX 4
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_TYPE u8
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_SIZE 8
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_MASK 0xFF
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_MSB  7
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_LSB  0
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_INDEX 6
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_ENUM_BOOT 0
    #define SI446X_CMD_FUNC_INFO_REP_FUNC_ENUM_MAIN 1

#define SI446X_CMD_ID_SET_PROPERTY                                             0x11
//SET_PROPERTY ARGS
#define SI446X_CMD_ARG_COUNT_SET_PROPERTY                                      16
    #define SI446X_CMD_SET_PROPERTY_ARG_GROUP_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_GROUP_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_GROUP_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_GROUP_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_GROUP_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_GROUP_INDEX 1
    #define SI446X_CMD_SET_PROPERTY_ARG_GROUP_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_INDEX 2
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_MIN 1
    #define SI446X_CMD_SET_PROPERTY_ARG_NUM_PROPS_MAX 12
    #define SI446X_CMD_SET_PROPERTY_ARG_START_PROP_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_START_PROP_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_START_PROP_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_START_PROP_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_START_PROP_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_START_PROP_INDEX 3
    #define SI446X_CMD_SET_PROPERTY_ARG_START_PROP_value (((cmd.arg.RAW[3])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA0_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA0_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA0_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA0_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA0_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA0_INDEX 4
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA0_value (((cmd.arg.RAW[4])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA1_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA1_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA1_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA1_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA1_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA1_INDEX 5
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA1_value (((cmd.arg.RAW[5])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA2_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA2_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA2_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA2_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA2_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA2_INDEX 6
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA2_value (((cmd.arg.RAW[6])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA3_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA3_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA3_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA3_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA3_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA3_INDEX 7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA3_value (((cmd.arg.RAW[7])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA4_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA4_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA4_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA4_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA4_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA4_INDEX 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA4_value (((cmd.arg.RAW[8])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA5_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA5_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA5_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA5_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA5_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA5_INDEX 9
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA5_value (((cmd.arg.RAW[9])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA6_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA6_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA6_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA6_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA6_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA6_INDEX 10
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA6_value (((cmd.arg.RAW[10])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA7_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA7_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA7_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA7_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA7_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA7_INDEX 11
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA7_value (((cmd.arg.RAW[11])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA8_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA8_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA8_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA8_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA8_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA8_INDEX 12
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA8_value (((cmd.arg.RAW[12])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA9_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA9_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA9_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA9_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA9_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA9_INDEX 13
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA9_value (((cmd.arg.RAW[13])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA10_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA10_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA10_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA10_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA10_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA10_INDEX 14
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA10_value (((cmd.arg.RAW[14])))
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA11_TYPE u8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA11_SIZE 8
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA11_MASK 0xFF
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA11_MSB  7
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA11_LSB  0
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA11_INDEX 15
    #define SI446X_CMD_SET_PROPERTY_ARG_DATA11_value (((cmd.arg.RAW[15])))
//SET_PROPERTY REPLY
#define SI446X_CMD_REPLY_COUNT_SET_PROPERTY                                    0

#define SI446X_CMD_ID_GET_PROPERTY                                             0x12
//GET_PROPERTY ARGS
#define SI446X_CMD_ARG_COUNT_GET_PROPERTY                                      4
    #define SI446X_CMD_GET_PROPERTY_ARG_GROUP_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_ARG_GROUP_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_ARG_GROUP_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_ARG_GROUP_MSB  7
    #define SI446X_CMD_GET_PROPERTY_ARG_GROUP_LSB  0
    #define SI446X_CMD_GET_PROPERTY_ARG_GROUP_INDEX 1
    #define SI446X_CMD_GET_PROPERTY_ARG_GROUP_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_MSB  7
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_LSB  0
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_INDEX 2
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_value (((cmd.arg.RAW[2])))
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_MIN 1
    #define SI446X_CMD_GET_PROPERTY_ARG_NUM_PROPS_MAX 16
    #define SI446X_CMD_GET_PROPERTY_ARG_START_PROP_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_ARG_START_PROP_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_ARG_START_PROP_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_ARG_START_PROP_MSB  7
    #define SI446X_CMD_GET_PROPERTY_ARG_START_PROP_LSB  0
    #define SI446X_CMD_GET_PROPERTY_ARG_START_PROP_INDEX 3
    #define SI446X_CMD_GET_PROPERTY_ARG_START_PROP_value (((cmd.arg.RAW[3])))
//GET_PROPERTY REPLY
#define SI446X_CMD_REPLY_COUNT_GET_PROPERTY                                    16
    #define SI446X_CMD_GET_PROPERTY_REP_DATA0_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA0_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA0_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA0_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA0_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA0_INDEX 1
    #define SI446X_CMD_GET_PROPERTY_REP_DATA1_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA1_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA1_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA1_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA1_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA1_INDEX 2
    #define SI446X_CMD_GET_PROPERTY_REP_DATA2_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA2_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA2_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA2_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA2_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA2_INDEX 3
    #define SI446X_CMD_GET_PROPERTY_REP_DATA3_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA3_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA3_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA3_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA3_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA3_INDEX 4
    #define SI446X_CMD_GET_PROPERTY_REP_DATA4_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA4_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA4_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA4_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA4_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA4_INDEX 5
    #define SI446X_CMD_GET_PROPERTY_REP_DATA5_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA5_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA5_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA5_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA5_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA5_INDEX 6
    #define SI446X_CMD_GET_PROPERTY_REP_DATA6_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA6_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA6_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA6_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA6_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA6_INDEX 7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA7_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA7_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA7_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA7_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA7_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA7_INDEX 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA8_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA8_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA8_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA8_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA8_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA8_INDEX 9
    #define SI446X_CMD_GET_PROPERTY_REP_DATA9_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA9_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA9_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA9_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA9_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA9_INDEX 10
    #define SI446X_CMD_GET_PROPERTY_REP_DATA10_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA10_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA10_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA10_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA10_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA10_INDEX 11
    #define SI446X_CMD_GET_PROPERTY_REP_DATA11_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA11_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA11_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA11_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA11_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA11_INDEX 12
    #define SI446X_CMD_GET_PROPERTY_REP_DATA12_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA12_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA12_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA12_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA12_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA12_INDEX 13
    #define SI446X_CMD_GET_PROPERTY_REP_DATA13_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA13_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA13_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA13_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA13_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA13_INDEX 14
    #define SI446X_CMD_GET_PROPERTY_REP_DATA14_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA14_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA14_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA14_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA14_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA14_INDEX 15
    #define SI446X_CMD_GET_PROPERTY_REP_DATA15_TYPE u8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA15_SIZE 8
    #define SI446X_CMD_GET_PROPERTY_REP_DATA15_MASK 0xFF
    #define SI446X_CMD_GET_PROPERTY_REP_DATA15_MSB  7
    #define SI446X_CMD_GET_PROPERTY_REP_DATA15_LSB  0
    #define SI446X_CMD_GET_PROPERTY_REP_DATA15_INDEX 16

