hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_CMD_ID_FRR_A_READ                                               0x50
//FRR_A_READ ARGS
#define SI446X_CMD_ARG_COUNT_FRR_A_READ                                        1
//FRR_A_READ REPLY
#define SI446X_CMD_REPLY_COUNT_FRR_A_READ                                      3
    #define SI446X_CMD_FRR_A_READ_REP_FRR_B_VALUE_TYPE u8
    #define SI446X_CMD_FRR_A_READ_REP_FRR_B_VALUE_SIZE 8
    #define SI446X_CMD_FRR_A_READ_REP_FRR_B_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_A_READ_REP_FRR_B_VALUE_MSB  7
    #define SI446X_CMD_FRR_A_READ_REP_FRR_B_VALUE_LSB  0
    #define SI446X_CMD_FRR_A_READ_REP_FRR_B_VALUE_INDEX 1
    #define SI446X_CMD_FRR_A_READ_REP_FRR_C_VALUE_TYPE u8
    #define SI446X_CMD_FRR_A_READ_REP_FRR_C_VALUE_SIZE 8
    #define SI446X_CMD_FRR_A_READ_REP_FRR_C_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_A_READ_REP_FRR_C_VALUE_MSB  7
    #define SI446X_CMD_FRR_A_READ_REP_FRR_C_VALUE_LSB  0
    #define SI446X_CMD_FRR_A_READ_REP_FRR_C_VALUE_INDEX 2
    #define SI446X_CMD_FRR_A_READ_REP_FRR_D_VALUE_TYPE u8
    #define SI446X_CMD_FRR_A_READ_REP_FRR_D_VALUE_SIZE 8
    #define SI446X_CMD_FRR_A_READ_REP_FRR_D_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_A_READ_REP_FRR_D_VALUE_MSB  7
    #define SI446X_CMD_FRR_A_READ_REP_FRR_D_VALUE_LSB  0
    #define SI446X_CMD_FRR_A_READ_REP_FRR_D_VALUE_INDEX 3

#define SI446X_CMD_ID_FRR_B_READ                                               0x51
//FRR_B_READ ARGS
#define SI446X_CMD_ARG_COUNT_FRR_B_READ                                        1
//FRR_B_READ REPLY
#define SI446X_CMD_REPLY_COUNT_FRR_B_READ                                      3
    #define SI446X_CMD_FRR_B_READ_REP_FRR_C_VALUE_TYPE u8
    #define SI446X_CMD_FRR_B_READ_REP_FRR_C_VALUE_SIZE 8
    #define SI446X_CMD_FRR_B_READ_REP_FRR_C_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_B_READ_REP_FRR_C_VALUE_MSB  7
    #define SI446X_CMD_FRR_B_READ_REP_FRR_C_VALUE_LSB  0
    #define SI446X_CMD_FRR_B_READ_REP_FRR_C_VALUE_INDEX 1
    #define SI446X_CMD_FRR_B_READ_REP_FRR_D_VALUE_TYPE u8
    #define SI446X_CMD_FRR_B_READ_REP_FRR_D_VALUE_SIZE 8
    #define SI446X_CMD_FRR_B_READ_REP_FRR_D_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_B_READ_REP_FRR_D_VALUE_MSB  7
    #define SI446X_CMD_FRR_B_READ_REP_FRR_D_VALUE_LSB  0
    #define SI446X_CMD_FRR_B_READ_REP_FRR_D_VALUE_INDEX 2
    #define SI446X_CMD_FRR_B_READ_REP_FRR_A_VALUE_TYPE u8
    #define SI446X_CMD_FRR_B_READ_REP_FRR_A_VALUE_SIZE 8
    #define SI446X_CMD_FRR_B_READ_REP_FRR_A_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_B_READ_REP_FRR_A_VALUE_MSB  7
    #define SI446X_CMD_FRR_B_READ_REP_FRR_A_VALUE_LSB  0
    #define SI446X_CMD_FRR_B_READ_REP_FRR_A_VALUE_INDEX 3

#define SI446X_CMD_ID_FRR_C_READ                                               0x53
//FRR_C_READ ARGS
#define SI446X_CMD_ARG_COUNT_FRR_C_READ                                        1
//FRR_C_READ REPLY
#define SI446X_CMD_REPLY_COUNT_FRR_C_READ                                      3
    #define SI446X_CMD_FRR_C_READ_REP_FRR_D_VALUE_TYPE u8
    #define SI446X_CMD_FRR_C_READ_REP_FRR_D_VALUE_SIZE 8
    #define SI446X_CMD_FRR_C_READ_REP_FRR_D_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_C_READ_REP_FRR_D_VALUE_MSB  7
    #define SI446X_CMD_FRR_C_READ_REP_FRR_D_VALUE_LSB  0
    #define SI446X_CMD_FRR_C_READ_REP_FRR_D_VALUE_INDEX 1
    #define SI446X_CMD_FRR_C_READ_REP_FRR_A_VALUE_TYPE u8
    #define SI446X_CMD_FRR_C_READ_REP_FRR_A_VALUE_SIZE 8
    #define SI446X_CMD_FRR_C_READ_REP_FRR_A_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_C_READ_REP_FRR_A_VALUE_MSB  7
    #define SI446X_CMD_FRR_C_READ_REP_FRR_A_VALUE_LSB  0
    #define SI446X_CMD_FRR_C_READ_REP_FRR_A_VALUE_INDEX 2
    #define SI446X_CMD_FRR_C_READ_REP_FRR_B_VALUE_TYPE u8
    #define SI446X_CMD_FRR_C_READ_REP_FRR_B_VALUE_SIZE 8
    #define SI446X_CMD_FRR_C_READ_REP_FRR_B_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_C_READ_REP_FRR_B_VALUE_MSB  7
    #define SI446X_CMD_FRR_C_READ_REP_FRR_B_VALUE_LSB  0
    #define SI446X_CMD_FRR_C_READ_REP_FRR_B_VALUE_INDEX 3

#define SI446X_CMD_ID_FRR_D_READ                                               0x57
//FRR_D_READ ARGS
#define SI446X_CMD_ARG_COUNT_FRR_D_READ                                        1
//FRR_D_READ REPLY
#define SI446X_CMD_REPLY_COUNT_FRR_D_READ                                      3
    #define SI446X_CMD_FRR_D_READ_REP_FRR_A_VALUE_TYPE u8
    #define SI446X_CMD_FRR_D_READ_REP_FRR_A_VALUE_SIZE 8
    #define SI446X_CMD_FRR_D_READ_REP_FRR_A_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_D_READ_REP_FRR_A_VALUE_MSB  7
    #define SI446X_CMD_FRR_D_READ_REP_FRR_A_VALUE_LSB  0
    #define SI446X_CMD_FRR_D_READ_REP_FRR_A_VALUE_INDEX 1
    #define SI446X_CMD_FRR_D_READ_REP_FRR_B_VALUE_TYPE u8
    #define SI446X_CMD_FRR_D_READ_REP_FRR_B_VALUE_SIZE 8
    #define SI446X_CMD_FRR_D_READ_REP_FRR_B_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_D_READ_REP_FRR_B_VALUE_MSB  7
    #define SI446X_CMD_FRR_D_READ_REP_FRR_B_VALUE_LSB  0
    #define SI446X_CMD_FRR_D_READ_REP_FRR_B_VALUE_INDEX 2
    #define SI446X_CMD_FRR_D_READ_REP_FRR_C_VALUE_TYPE u8
    #define SI446X_CMD_FRR_D_READ_REP_FRR_C_VALUE_SIZE 8
    #define SI446X_CMD_FRR_D_READ_REP_FRR_C_VALUE_MASK 0xFF
    #define SI446X_CMD_FRR_D_READ_REP_FRR_C_VALUE_MSB  7
    #define SI446X_CMD_FRR_D_READ_REP_FRR_C_VALUE_LSB  0
    #define SI446X_CMD_FRR_D_READ_REP_FRR_C_VALUE_INDEX 3

#define SI446X_CMD_ID_WRITE_TX_FIFO                                            0x66
//WRITE_TX_FIFO ARGS
#define SI446X_CMD_ARG_COUNT_WRITE_TX_FIFO                                     2
    #define SI446X_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_TYPE u8
    #define SI446X_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_SIZE 8
    #define SI446X_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_MASK 0xFF
    #define SI446X_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_MSB  7
    #define SI446X_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_LSB  0
    #define SI446X_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_INDEX 1
    #define SI446X_CMD_WRITE_TX_FIFO_ARG_FIRST_BYTE_value (((cmd.arg.RAW[1])))
//WRITE_TX_FIFO REPLY
#define SI446X_CMD_REPLY_COUNT_WRITE_TX_FIFO                                   0

#define SI446X_CMD_ID_READ_RX_FIFO                                             0x77
//READ_RX_FIFO ARGS
#define SI446X_CMD_ARG_COUNT_READ_RX_FIFO                                      1
//READ_RX_FIFO REPLY
#define SI446X_CMD_REPLY_COUNT_READ_RX_FIFO                                    0

#define SI446X_CMD_ID_AGC_OVERRIDE                                             0xD0
//AGC_OVERRIDE ARGS
#define SI446X_CMD_ARG_COUNT_AGC_OVERRIDE                                      2
    #define SI446X_CMD_AGC_OVERRIDE_ARG_AGC_OVERRIDE_TYPE bitfield
    #define SI446X_CMD_AGC_OVERRIDE_ARG_AGC_OVERRIDE_SIZE 8
    #define SI446X_CMD_AGC_OVERRIDE_ARG_AGC_OVERRIDE_MASK 0xFF
    #define SI446X_CMD_AGC_OVERRIDE_ARG_AGC_OVERRIDE_MSB  7
    #define SI446X_CMD_AGC_OVERRIDE_ARG_AGC_OVERRIDE_LSB  0
    #define SI446X_CMD_AGC_OVERRIDE_ARG_AGC_OVERRIDE_INDEX 1
    #define SI446X_CMD_AGC_OVERRIDE_ARG_AGC_OVERRIDE_value (((cmd.arg.RAW[1])))
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_TYPE bitfield
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_SIZE 1
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_MASK 0x80
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_BIT  0x80
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_MSB  7
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_LSB  7
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_INDEX 1
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_is_true (cmd.arg.RAW[1]&0x80)
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_PGA_AGC_value (((cmd.arg.RAW[1]&0x80))>>7)
    #define SI446X_CMD_AGC_OVERRIDE_ARG_PGA_GAIN_CFG_TYPE bitfield
    #define SI446X_CMD_AGC_OVERRIDE_ARG_PGA_GAIN_CFG_SIZE 3
    #define SI446X_CMD_AGC_OVERRIDE_ARG_PGA_GAIN_CFG_MASK 0x70
    #define SI446X_CMD_AGC_OVERRIDE_ARG_PGA_GAIN_CFG_MSB  6
    #define SI446X_CMD_AGC_OVERRIDE_ARG_PGA_GAIN_CFG_LSB  4
    #define SI446X_CMD_AGC_OVERRIDE_ARG_PGA_GAIN_CFG_INDEX 1
    #define SI446X_CMD_AGC_OVERRIDE_ARG_PGA_GAIN_CFG_value (((cmd.arg.RAW[1]&0x70))>>4)
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_TYPE bitfield
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_SIZE 1
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_MASK 0x08
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_BIT  0x08
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_MSB  3
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_LSB  3
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_INDEX 1
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_is_true (cmd.arg.RAW[1]&0x8)
    #define SI446X_CMD_AGC_OVERRIDE_ARG_DIS_LNA_AGC_value (((cmd.arg.RAW[1]&0x8))>>3)
    #define SI446X_CMD_AGC_OVERRIDE_ARG_LNA_GAIN_CFG_TYPE bitfield
    #define SI446X_CMD_AGC_OVERRIDE_ARG_LNA_GAIN_CFG_SIZE 3
    #define SI446X_CMD_AGC_OVERRIDE_ARG_LNA_GAIN_CFG_MASK 0x07
    #define SI446X_CMD_AGC_OVERRIDE_ARG_LNA_GAIN_CFG_MSB  2
    #define SI446X_CMD_AGC_OVERRIDE_ARG_LNA_GAIN_CFG_LSB  0
    #define SI446X_CMD_AGC_OVERRIDE_ARG_LNA_GAIN_CFG_INDEX 1
    #define SI446X_CMD_AGC_OVERRIDE_ARG_LNA_GAIN_CFG_value (((cmd.arg.RAW[1]&0x7)))
//AGC_OVERRIDE REPLY
#define SI446X_CMD_REPLY_COUNT_AGC_OVERRIDE                                    0



// Property group Id defines.
#define SI446X_PROP_GRP_ID_RX_HOP                                              80
#define SI446X_PROP_GRP_ID_PA                                                  34
#define SI446X_PROP_GRP_ID_MODEM                                               32
#define SI446X_PROP_GRP_ID_FRR_CTL                                             2
#define SI446X_PROP_GRP_ID_INT_CTL                                             1
#define SI446X_PROP_GRP_ID_SYNC                                                17
#define SI446X_PROP_GRP_ID_OTP_VARS                                            242
#define SI446X_PROP_GRP_ID_PKT                                                 18
#define SI446X_PROP_GRP_ID_PREAMBLE                                            16
#define SI446X_PROP_GRP_ID_GLOBAL                                              0
#define SI446X_PROP_GRP_ID_MODEM_CHFLT                                         33
#define SI446X_PROP_GRP_ID_MATCH                                               48
#define SI446X_PROP_GRP_ID_SYNTH                                               35
#define SI446X_PROP_GRP_ID_FREQ_CONTROL                                        64

// Property group length defines.
#define SI446X_PROP_GRP_LEN_RX_HOP                                             66
#define SI446X_PROP_GRP_LEN_PA                                                 7
#define SI446X_PROP_GRP_LEN_MODEM                                              84
#define SI446X_PROP_GRP_LEN_FRR_CTL                                            4
#define SI446X_PROP_GRP_LEN_INT_CTL                                            4
#define SI446X_PROP_GRP_LEN_SYNC                                               5
#define SI446X_PROP_GRP_LEN_OTP_VARS                                           45
#define SI446X_PROP_GRP_LEN_PKT                                                53
#define SI446X_PROP_GRP_LEN_PREAMBLE                                           14
#define SI446X_PROP_GRP_LEN_GLOBAL                                             10
#define SI446X_PROP_GRP_LEN_MODEM_CHFLT                                        36
#define SI446X_PROP_GRP_LEN_MATCH                                              12
#define SI446X_PROP_GRP_LEN_SYNTH                                              8
#define SI446X_PROP_GRP_LEN_FREQ_CONTROL                                       8

// Property index within a group defines.
#define SI446X_PROP_GRP_INDEX_RX_HOP_CONTROL                                   0
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_SIZE                                1
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_0                             2
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_1                             3
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_2                             4
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_3                             5
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_4                             6
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_5                             7
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_6                             8
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_7                             9
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_8                             10
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_9                             11
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_10                            12
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_11                            13
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_12                            14
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_13                            15
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_14                            16
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_15                            17
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_16                            18
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_17                            19
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_18                            20
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_19                            21
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_20                            22
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_21                            23
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_22                            24
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_23                            25
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_24                            26
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_25                            27
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_26                            28
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_27                            29
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_28                            30
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_29                            31
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_30                            32
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_31                            33
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_32                            34
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_33                            35
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_34                            36
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_35                            37
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_36                            38
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_37                            39
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_38                            40
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_39                            41
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_40                            42
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_41                            43
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_42                            44
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_43                            45
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_44                            46
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_45                            47
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_46                            48
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_47                            49
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_48                            50
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_49                            51
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_50                            52
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_51                            53
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_52                            54
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_53                            55
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_54                            56
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_55                            57
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_56                            58
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_57                            59
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_58                            60
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_59                            61
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_60                            62
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_61                            63
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_62                            64
#define SI446X_PROP_GRP_INDEX_RX_HOP_TABLE_ENTRY_63                            65

#define SI446X_PROP_GRP_INDEX_PA_MODE                                          0
#define SI446X_PROP_GRP_INDEX_PA_PWR_LVL                                       1
#define SI446X_PROP_GRP_INDEX_PA_BIAS_CLKDUTY                                  2
#define SI446X_PROP_GRP_INDEX_PA_TC                                            3
#define SI446X_PROP_GRP_INDEX_PA_RAMP_EX                                       4
#define SI446X_PROP_GRP_INDEX_PA_RAMP_DOWN_DELAY                               5
#define SI446X_PROP_GRP_INDEX_PA_STEP_SIZE                                     6

