hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_MASK                                0xFF
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_DEFAULT                             0
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_PATTERN_23_16_SIZE                  8
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_PATTERN_23_16_LSB                   0
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_PATTERN_23_16_MSB                   7
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_PATTERN_23_16_MIN                   0
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_PATTERN_23_16_MAX                   0xff
#define SI446X_PROP_PREAMBLE_PATTERN_23_16_PATTERN_23_16_MASK                  0xFF

#define SI446X_PROP_PREAMBLE_PATTERN_15_8_MASK                                 0xFF
#define SI446X_PROP_PREAMBLE_PATTERN_15_8_DEFAULT                              0
#define SI446X_PROP_PREAMBLE_PATTERN_15_8_PATTERN_15_8_SIZE                    8
#define SI446X_PROP_PREAMBLE_PATTERN_15_8_PATTERN_15_8_LSB                     0
#define SI446X_PROP_PREAMBLE_PATTERN_15_8_PATTERN_15_8_MSB                     7
#define SI446X_PROP_PREAMBLE_PATTERN_15_8_PATTERN_15_8_MIN                     0
#define SI446X_PROP_PREAMBLE_PATTERN_15_8_PATTERN_15_8_MAX                     0xff
#define SI446X_PROP_PREAMBLE_PATTERN_15_8_PATTERN_15_8_MASK                    0xFF

#define SI446X_PROP_PREAMBLE_PATTERN_7_0_MASK                                  0xFF
#define SI446X_PROP_PREAMBLE_PATTERN_7_0_DEFAULT                               0
#define SI446X_PROP_PREAMBLE_PATTERN_7_0_PATTERN_7_0_SIZE                      8
#define SI446X_PROP_PREAMBLE_PATTERN_7_0_PATTERN_7_0_LSB                       0
#define SI446X_PROP_PREAMBLE_PATTERN_7_0_PATTERN_7_0_MSB                       7
#define SI446X_PROP_PREAMBLE_PATTERN_7_0_PATTERN_7_0_MIN                       0
#define SI446X_PROP_PREAMBLE_PATTERN_7_0_PATTERN_7_0_MAX                       0xff
#define SI446X_PROP_PREAMBLE_PATTERN_7_0_PATTERN_7_0_MASK                      0xFF

#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_MASK                             0xFF
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_DEFAULT                          0x00
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_ENABLE_SIZE            1
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_ENABLE_LSB             7
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_ENABLE_MSB             7
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_ENABLE_MASK            0x80
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_ENABLE_BIT             0x80
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_ENABLE_ENUM_FALSE      0x0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_ENABLE_ENUM_TRUE       0x1
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_PKT_VALID_ON_POSTAMBLE_SIZE      1
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_PKT_VALID_ON_POSTAMBLE_LSB       6
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_PKT_VALID_ON_POSTAMBLE_MSB       6
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_PKT_VALID_ON_POSTAMBLE_MASK      0x40
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_PKT_VALID_ON_POSTAMBLE_BIT       0x40
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_PKT_VALID_ON_POSTAMBLE_ENUM_FALSE 0x0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_PKT_VALID_ON_POSTAMBLE_ENUM_TRUE 0x1
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_SIZE_SIZE              2
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_SIZE_LSB               0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_SIZE_MSB               1
#define SI446X_PROP_PREAMBLE_POSTAMBLE_CONFIG_POSTAMBLE_SIZE_MASK              0x3

#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_MASK                      0xFF
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_DEFAULT                   0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_POSTAMBLE_PATTERN_31_24_SIZE 8
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_POSTAMBLE_PATTERN_31_24_LSB 0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_POSTAMBLE_PATTERN_31_24_MSB 7
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_POSTAMBLE_PATTERN_31_24_MIN 0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_POSTAMBLE_PATTERN_31_24_MAX 0xff
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_31_24_POSTAMBLE_PATTERN_31_24_MASK 0xFF

#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_MASK                      0xFF
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_DEFAULT                   0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_POSTAMBLE_PATTERN_23_16_SIZE 8
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_POSTAMBLE_PATTERN_23_16_LSB 0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_POSTAMBLE_PATTERN_23_16_MSB 7
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_POSTAMBLE_PATTERN_23_16_MIN 0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_POSTAMBLE_PATTERN_23_16_MAX 0xff
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_23_16_POSTAMBLE_PATTERN_23_16_MASK 0xFF

#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_MASK                       0xFF
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_DEFAULT                    0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_POSTAMBLE_PATTERN_15_8_SIZE 8
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_POSTAMBLE_PATTERN_15_8_LSB 0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_POSTAMBLE_PATTERN_15_8_MSB 7
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_POSTAMBLE_PATTERN_15_8_MIN 0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_POSTAMBLE_PATTERN_15_8_MAX 0xff
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_15_8_POSTAMBLE_PATTERN_15_8_MASK 0xFF

#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_MASK                        0xFF
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_DEFAULT                     0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_POSTAMBLE_PATTERN_7_0_SIZE  8
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_POSTAMBLE_PATTERN_7_0_LSB   0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_POSTAMBLE_PATTERN_7_0_MSB   7
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_POSTAMBLE_PATTERN_7_0_MIN   0
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_POSTAMBLE_PATTERN_7_0_MAX   0xff
#define SI446X_PROP_PREAMBLE_POSTAMBLE_PATTERN_7_0_POSTAMBLE_PATTERN_7_0_MASK  0xFF

#define SI446X_PROP_SYNC_CONFIG_MASK                                           0xFF
#define SI446X_PROP_SYNC_CONFIG_DEFAULT                                        0x01
#define SI446X_PROP_SYNC_CONFIG_SKIP_TX_SIZE                                   1
#define SI446X_PROP_SYNC_CONFIG_SKIP_TX_LSB                                    7
#define SI446X_PROP_SYNC_CONFIG_SKIP_TX_MSB                                    7
#define SI446X_PROP_SYNC_CONFIG_SKIP_TX_MASK                                   0x80
#define SI446X_PROP_SYNC_CONFIG_SKIP_TX_BIT                                    0x80
#define SI446X_PROP_SYNC_CONFIG_RX_ERRORS_SIZE                                 3
#define SI446X_PROP_SYNC_CONFIG_RX_ERRORS_LSB                                  4
#define SI446X_PROP_SYNC_CONFIG_RX_ERRORS_MSB                                  6
#define SI446X_PROP_SYNC_CONFIG_RX_ERRORS_MASK                                 0x70
#define SI446X_PROP_SYNC_CONFIG_4FSK_SIZE                                      1
#define SI446X_PROP_SYNC_CONFIG_4FSK_LSB                                       3
#define SI446X_PROP_SYNC_CONFIG_4FSK_MSB                                       3
#define SI446X_PROP_SYNC_CONFIG_4FSK_MASK                                      0x8
#define SI446X_PROP_SYNC_CONFIG_4FSK_BIT                                       0x8
#define SI446X_PROP_SYNC_CONFIG_MANCH_SIZE                                     1
#define SI446X_PROP_SYNC_CONFIG_MANCH_LSB                                      2
#define SI446X_PROP_SYNC_CONFIG_MANCH_MSB                                      2
#define SI446X_PROP_SYNC_CONFIG_MANCH_MASK                                     0x4
#define SI446X_PROP_SYNC_CONFIG_MANCH_BIT                                      0x4
#define SI446X_PROP_SYNC_CONFIG_LENGTH_SIZE                                    2
#define SI446X_PROP_SYNC_CONFIG_LENGTH_LSB                                     0
#define SI446X_PROP_SYNC_CONFIG_LENGTH_MSB                                     1
#define SI446X_PROP_SYNC_CONFIG_LENGTH_MASK                                    0x3

#define SI446X_PROP_SYNC_BITS_31_24_MASK                                       0xFF
#define SI446X_PROP_SYNC_BITS_31_24_DEFAULT                                    0x2D
#define SI446X_PROP_SYNC_BITS_31_24_BITS_31_24_SIZE                            8
#define SI446X_PROP_SYNC_BITS_31_24_BITS_31_24_LSB                             0
#define SI446X_PROP_SYNC_BITS_31_24_BITS_31_24_MSB                             7
#define SI446X_PROP_SYNC_BITS_31_24_BITS_31_24_MIN                             0
#define SI446X_PROP_SYNC_BITS_31_24_BITS_31_24_MAX                             0xff
#define SI446X_PROP_SYNC_BITS_31_24_BITS_31_24_MASK                            0xFF

