hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_SYNC_BITS_23_16_MASK                                       0xFF
#define SI446X_PROP_SYNC_BITS_23_16_DEFAULT                                    0xD4
#define SI446X_PROP_SYNC_BITS_23_16_BITS_23_16_SIZE                            8
#define SI446X_PROP_SYNC_BITS_23_16_BITS_23_16_LSB                             0
#define SI446X_PROP_SYNC_BITS_23_16_BITS_23_16_MSB                             7
#define SI446X_PROP_SYNC_BITS_23_16_BITS_23_16_MIN                             0
#define SI446X_PROP_SYNC_BITS_23_16_BITS_23_16_MAX                             0xff
#define SI446X_PROP_SYNC_BITS_23_16_BITS_23_16_MASK                            0xFF

#define SI446X_PROP_SYNC_BITS_15_8_MASK                                        0xFF
#define SI446X_PROP_SYNC_BITS_15_8_DEFAULT                                     0x2D
#define SI446X_PROP_SYNC_BITS_15_8_BITS_15_8_SIZE                              8
#define SI446X_PROP_SYNC_BITS_15_8_BITS_15_8_LSB                               0
#define SI446X_PROP_SYNC_BITS_15_8_BITS_15_8_MSB                               7
#define SI446X_PROP_SYNC_BITS_15_8_BITS_15_8_MIN                               0
#define SI446X_PROP_SYNC_BITS_15_8_BITS_15_8_MAX                               0xff
#define SI446X_PROP_SYNC_BITS_15_8_BITS_15_8_MASK                              0xFF

#define SI446X_PROP_SYNC_BITS_7_0_MASK                                         0xFF
#define SI446X_PROP_SYNC_BITS_7_0_DEFAULT                                      0xD4
#define SI446X_PROP_SYNC_BITS_7_0_BITS_7_0_SIZE                                8
#define SI446X_PROP_SYNC_BITS_7_0_BITS_7_0_LSB                                 0
#define SI446X_PROP_SYNC_BITS_7_0_BITS_7_0_MSB                                 7
#define SI446X_PROP_SYNC_BITS_7_0_BITS_7_0_MIN                                 0
#define SI446X_PROP_SYNC_BITS_7_0_BITS_7_0_MAX                                 0xff
#define SI446X_PROP_SYNC_BITS_7_0_BITS_7_0_MASK                                0xFF

#define SI446X_PROP_PKT_CRC_CONFIG_MASK                                        0xFF
#define SI446X_PROP_PKT_CRC_CONFIG_DEFAULT                                     0
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_SEED_SIZE                               1
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_SEED_LSB                                7
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_SEED_MSB                                7
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_SEED_MASK                               0x80
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_SEED_BIT                                0x80
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_SIZE                         4
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_LSB                          0
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_MSB                          3
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_MASK                         0xF
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_NO_CRC                  0
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_ITU_T_CRC8              1
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_IEC_16                  2
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_BAICHEVA_16             3
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_CRC_16_IBM              4
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_CCITT_16                5
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_KOOPMAN                 6
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_IEEE_802_3              7
#define SI446X_PROP_PKT_CRC_CONFIG_CRC_POLYNOMIAL_ENUM_CASTAGNOLI              8






#define SI446X_PROP_PKT_CONFIG1_MASK                                           0xFF
#define SI446X_PROP_PKT_CONFIG1_DEFAULT                                        0
#define SI446X_PROP_PKT_CONFIG1_PH_FIELD_SPLIT_SIZE                            1
#define SI446X_PROP_PKT_CONFIG1_PH_FIELD_SPLIT_LSB                             7
#define SI446X_PROP_PKT_CONFIG1_PH_FIELD_SPLIT_MSB                             7
#define SI446X_PROP_PKT_CONFIG1_PH_FIELD_SPLIT_MASK                            0x80
#define SI446X_PROP_PKT_CONFIG1_PH_FIELD_SPLIT_BIT                             0x80
#define SI446X_PROP_PKT_CONFIG1_PH_RX_DISABLE_SIZE                             1
#define SI446X_PROP_PKT_CONFIG1_PH_RX_DISABLE_LSB                              6
#define SI446X_PROP_PKT_CONFIG1_PH_RX_DISABLE_MSB                              6
#define SI446X_PROP_PKT_CONFIG1_PH_RX_DISABLE_MASK                             0x40
#define SI446X_PROP_PKT_CONFIG1_PH_RX_DISABLE_BIT                              0x40
#define SI446X_PROP_PKT_CONFIG1_4FSK_EN_SIZE                                   1
#define SI446X_PROP_PKT_CONFIG1_4FSK_EN_LSB                                    5
#define SI446X_PROP_PKT_CONFIG1_4FSK_EN_MSB                                    5
#define SI446X_PROP_PKT_CONFIG1_4FSK_EN_MASK                                   0x20
#define SI446X_PROP_PKT_CONFIG1_4FSK_EN_BIT                                    0x20
#define SI446X_PROP_PKT_CONFIG1_RX_MULTI_PKT_SIZE                              1
#define SI446X_PROP_PKT_CONFIG1_RX_MULTI_PKT_LSB                               4
#define SI446X_PROP_PKT_CONFIG1_RX_MULTI_PKT_MSB                               4
#define SI446X_PROP_PKT_CONFIG1_RX_MULTI_PKT_MASK                              0x10
#define SI446X_PROP_PKT_CONFIG1_RX_MULTI_PKT_BIT                               0x10
#define SI446X_PROP_PKT_CONFIG1_MANCH_POL_SIZE                                 1
#define SI446X_PROP_PKT_CONFIG1_MANCH_POL_LSB                                  3
#define SI446X_PROP_PKT_CONFIG1_MANCH_POL_MSB                                  3
#define SI446X_PROP_PKT_CONFIG1_MANCH_POL_MASK                                 0x8
#define SI446X_PROP_PKT_CONFIG1_MANCH_POL_BIT                                  0x8
#define SI446X_PROP_PKT_CONFIG1_CRC_INVERT_SIZE                                1
#define SI446X_PROP_PKT_CONFIG1_CRC_INVERT_LSB                                 2
#define SI446X_PROP_PKT_CONFIG1_CRC_INVERT_MSB                                 2
#define SI446X_PROP_PKT_CONFIG1_CRC_INVERT_MASK                                0x4
#define SI446X_PROP_PKT_CONFIG1_CRC_INVERT_BIT                                 0x4
#define SI446X_PROP_PKT_CONFIG1_CRC_ENDIAN_SIZE                                1
#define SI446X_PROP_PKT_CONFIG1_CRC_ENDIAN_LSB                                 1
#define SI446X_PROP_PKT_CONFIG1_CRC_ENDIAN_MSB                                 1
#define SI446X_PROP_PKT_CONFIG1_CRC_ENDIAN_MASK                                0x2
#define SI446X_PROP_PKT_CONFIG1_CRC_ENDIAN_BIT                                 0x2
#define SI446X_PROP_PKT_CONFIG1_BIT_ORDER_SIZE                                 1
#define SI446X_PROP_PKT_CONFIG1_BIT_ORDER_LSB                                  0
#define SI446X_PROP_PKT_CONFIG1_BIT_ORDER_MSB                                  0
#define SI446X_PROP_PKT_CONFIG1_BIT_ORDER_MASK                                 0x1
#define SI446X_PROP_PKT_CONFIG1_BIT_ORDER_BIT                                  0x1


