hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_PKT_LEN_MASK                                               0xFF
#define SI446X_PROP_PKT_LEN_DEFAULT                                            0x00
#define SI446X_PROP_PKT_LEN_ENDIAN_SIZE                                        1
#define SI446X_PROP_PKT_LEN_ENDIAN_LSB                                         5
#define SI446X_PROP_PKT_LEN_ENDIAN_MSB                                         5
#define SI446X_PROP_PKT_LEN_ENDIAN_MASK                                        0x20
#define SI446X_PROP_PKT_LEN_ENDIAN_BIT                                         0x20
#define SI446X_PROP_PKT_LEN_ENDIAN_ENUM_LITTLE                                 0x0
#define SI446X_PROP_PKT_LEN_ENDIAN_ENUM_BIG                                    0x1
#define SI446X_PROP_PKT_LEN_SIZE_SIZE                                          1
#define SI446X_PROP_PKT_LEN_SIZE_LSB                                           4
#define SI446X_PROP_PKT_LEN_SIZE_MSB                                           4
#define SI446X_PROP_PKT_LEN_SIZE_MASK                                          0x10
#define SI446X_PROP_PKT_LEN_SIZE_BIT                                           0x10
#define SI446X_PROP_PKT_LEN_IN_FIFO_SIZE                                       1
#define SI446X_PROP_PKT_LEN_IN_FIFO_LSB                                        3
#define SI446X_PROP_PKT_LEN_IN_FIFO_MSB                                        3
#define SI446X_PROP_PKT_LEN_IN_FIFO_MASK                                       0x8
#define SI446X_PROP_PKT_LEN_IN_FIFO_BIT                                        0x8
#define SI446X_PROP_PKT_LEN_IN_FIFO_ENUM_CUT_OUT                               0x0
#define SI446X_PROP_PKT_LEN_IN_FIFO_ENUM_LEAVE_IN                              0x1
#define SI446X_PROP_PKT_LEN_DST_FIELD_SIZE                                     3
#define SI446X_PROP_PKT_LEN_DST_FIELD_LSB                                      0
#define SI446X_PROP_PKT_LEN_DST_FIELD_MSB                                      2
#define SI446X_PROP_PKT_LEN_DST_FIELD_MASK                                     0x7

#define SI446X_PROP_PKT_LEN_FIELD_SOURCE_MASK                                  0xFF
#define SI446X_PROP_PKT_LEN_FIELD_SOURCE_DEFAULT                               0
#define SI446X_PROP_PKT_LEN_FIELD_SOURCE_SRC_FIELD_SIZE                        3
#define SI446X_PROP_PKT_LEN_FIELD_SOURCE_SRC_FIELD_LSB                         0
#define SI446X_PROP_PKT_LEN_FIELD_SOURCE_SRC_FIELD_MSB                         2
#define SI446X_PROP_PKT_LEN_FIELD_SOURCE_SRC_FIELD_MASK                        0x7

#define SI446X_PROP_PKT_LEN_ADJUST_MASK                                        0xFF
#define SI446X_PROP_PKT_LEN_ADJUST_DEFAULT                                     0
#define SI446X_PROP_PKT_LEN_ADJUST_LEN_ADJUST_SIZE                             8
#define SI446X_PROP_PKT_LEN_ADJUST_LEN_ADJUST_LSB                              0
#define SI446X_PROP_PKT_LEN_ADJUST_LEN_ADJUST_MSB                              7
#define SI446X_PROP_PKT_LEN_ADJUST_LEN_ADJUST_MIN                              -128
#define SI446X_PROP_PKT_LEN_ADJUST_LEN_ADJUST_MAX                              127
#define SI446X_PROP_PKT_LEN_ADJUST_LEN_ADJUST_MASK                             0xFF

#define SI446X_PROP_PKT_TX_THRESHOLD_MASK                                      0xFF
#define SI446X_PROP_PKT_TX_THRESHOLD_DEFAULT                                   0x30
#define SI446X_PROP_PKT_TX_THRESHOLD_TX_THRESHOLD_SIZE                         8
#define SI446X_PROP_PKT_TX_THRESHOLD_TX_THRESHOLD_LSB                          0
#define SI446X_PROP_PKT_TX_THRESHOLD_TX_THRESHOLD_MSB                          7
#define SI446X_PROP_PKT_TX_THRESHOLD_TX_THRESHOLD_MIN                          0
#define SI446X_PROP_PKT_TX_THRESHOLD_TX_THRESHOLD_MAX                          64
#define SI446X_PROP_PKT_TX_THRESHOLD_TX_THRESHOLD_MASK                         0xFF

#define SI446X_PROP_PKT_RX_THRESHOLD_MASK                                      0xFF
#define SI446X_PROP_PKT_RX_THRESHOLD_DEFAULT                                   0x30
#define SI446X_PROP_PKT_RX_THRESHOLD_RX_THRESHOLD_SIZE                         8
#define SI446X_PROP_PKT_RX_THRESHOLD_RX_THRESHOLD_LSB                          0
#define SI446X_PROP_PKT_RX_THRESHOLD_RX_THRESHOLD_MSB                          7
#define SI446X_PROP_PKT_RX_THRESHOLD_RX_THRESHOLD_MIN                          0
#define SI446X_PROP_PKT_RX_THRESHOLD_RX_THRESHOLD_MAX                          64
#define SI446X_PROP_PKT_RX_THRESHOLD_RX_THRESHOLD_MASK                         0xFF

#define SI446X_PROP_PKT_FIELD_1_LENGTH_12_8_MASK                               0xFF
#define SI446X_PROP_PKT_FIELD_1_LENGTH_12_8_DEFAULT                            0x00
#define SI446X_PROP_PKT_FIELD_1_LENGTH_12_8_FIELD_1_LENGTH_12_8_SIZE           5
#define SI446X_PROP_PKT_FIELD_1_LENGTH_12_8_FIELD_1_LENGTH_12_8_LSB            0
#define SI446X_PROP_PKT_FIELD_1_LENGTH_12_8_FIELD_1_LENGTH_12_8_MSB            4
#define SI446X_PROP_PKT_FIELD_1_LENGTH_12_8_FIELD_1_LENGTH_12_8_MASK           0x1F

#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_FIELD_1_LENGTH_7_0_SIZE             8
#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_FIELD_1_LENGTH_7_0_LSB              0
#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_FIELD_1_LENGTH_7_0_MSB              7
#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_FIELD_1_LENGTH_7_0_MIN              0
#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_FIELD_1_LENGTH_7_0_MAX              0xff
#define SI446X_PROP_PKT_FIELD_1_LENGTH_7_0_FIELD_1_LENGTH_7_0_MASK             0xFF

#define SI446X_PROP_PKT_FIELD_1_CONFIG_MASK                                    0xFF
#define SI446X_PROP_PKT_FIELD_1_CONFIG_DEFAULT                                 0x00
#define SI446X_PROP_PKT_FIELD_1_CONFIG_4FSK_SIZE                               1
#define SI446X_PROP_PKT_FIELD_1_CONFIG_4FSK_LSB                                4
#define SI446X_PROP_PKT_FIELD_1_CONFIG_4FSK_MSB                                4
#define SI446X_PROP_PKT_FIELD_1_CONFIG_4FSK_MASK                               0x10
#define SI446X_PROP_PKT_FIELD_1_CONFIG_4FSK_BIT                                0x10
#define SI446X_PROP_PKT_FIELD_1_CONFIG_PN_START_SIZE                           1
#define SI446X_PROP_PKT_FIELD_1_CONFIG_PN_START_LSB                            2
#define SI446X_PROP_PKT_FIELD_1_CONFIG_PN_START_MSB                            2
#define SI446X_PROP_PKT_FIELD_1_CONFIG_PN_START_MASK                           0x4
#define SI446X_PROP_PKT_FIELD_1_CONFIG_PN_START_BIT                            0x4
#define SI446X_PROP_PKT_FIELD_1_CONFIG_WHITEN_SIZE                             1
#define SI446X_PROP_PKT_FIELD_1_CONFIG_WHITEN_LSB                              1
#define SI446X_PROP_PKT_FIELD_1_CONFIG_WHITEN_MSB                              1
#define SI446X_PROP_PKT_FIELD_1_CONFIG_WHITEN_MASK                             0x2
#define SI446X_PROP_PKT_FIELD_1_CONFIG_WHITEN_BIT                              0x2
#define SI446X_PROP_PKT_FIELD_1_CONFIG_MANCH_SIZE                              1
#define SI446X_PROP_PKT_FIELD_1_CONFIG_MANCH_LSB                               0
#define SI446X_PROP_PKT_FIELD_1_CONFIG_MANCH_MSB                               0
#define SI446X_PROP_PKT_FIELD_1_CONFIG_MANCH_MASK                              0x1
#define SI446X_PROP_PKT_FIELD_1_CONFIG_MANCH_BIT                               0x1

#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_MASK                                0xFF
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_DEFAULT                             0x00
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_START_SIZE                      1
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_START_LSB                       7
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_START_MSB                       7
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_START_MASK                      0x80
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_START_BIT                       0x80
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_SEND_CRC_SIZE                       1
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_SEND_CRC_LSB                        5
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_SEND_CRC_MSB                        5
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_SEND_CRC_MASK                       0x20
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_SEND_CRC_BIT                        0x20
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CHECK_CRC_SIZE                      1
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CHECK_CRC_LSB                       3
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CHECK_CRC_MSB                       3
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CHECK_CRC_MASK                      0x8
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CHECK_CRC_BIT                       0x8
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_ENABLE_SIZE                     1
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_ENABLE_LSB                      1
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_ENABLE_MSB                      1
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_ENABLE_MASK                     0x2
#define SI446X_PROP_PKT_FIELD_1_CRC_CONFIG_CRC_ENABLE_BIT                      0x2

#define SI446X_PROP_PKT_FIELD_2_LENGTH_12_8_MASK                               0xFF
#define SI446X_PROP_PKT_FIELD_2_LENGTH_12_8_DEFAULT                            0x00
#define SI446X_PROP_PKT_FIELD_2_LENGTH_12_8_FIELD_2_LENGTH_12_8_SIZE           5
#define SI446X_PROP_PKT_FIELD_2_LENGTH_12_8_FIELD_2_LENGTH_12_8_LSB            0
#define SI446X_PROP_PKT_FIELD_2_LENGTH_12_8_FIELD_2_LENGTH_12_8_MSB            4
#define SI446X_PROP_PKT_FIELD_2_LENGTH_12_8_FIELD_2_LENGTH_12_8_MASK           0x1F

