hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_MODEM_DATA_RATE_1_MASK                                     0xFF
#define SI446X_PROP_MODEM_DATA_RATE_1_DEFAULT                                  0x42
#define SI446X_PROP_MODEM_DATA_RATE_1_DR_15_8_SIZE                             8
#define SI446X_PROP_MODEM_DATA_RATE_1_DR_15_8_LSB                              0
#define SI446X_PROP_MODEM_DATA_RATE_1_DR_15_8_MSB                              7
#define SI446X_PROP_MODEM_DATA_RATE_1_DR_15_8_MIN                              0
#define SI446X_PROP_MODEM_DATA_RATE_1_DR_15_8_MAX                              255
#define SI446X_PROP_MODEM_DATA_RATE_1_DR_15_8_MASK                             0xFF

#define SI446X_PROP_MODEM_DATA_RATE_0_MASK                                     0xFF
#define SI446X_PROP_MODEM_DATA_RATE_0_DEFAULT                                  0x40
#define SI446X_PROP_MODEM_DATA_RATE_0_DR_7_0_SIZE                              8
#define SI446X_PROP_MODEM_DATA_RATE_0_DR_7_0_LSB                               0
#define SI446X_PROP_MODEM_DATA_RATE_0_DR_7_0_MSB                               7
#define SI446X_PROP_MODEM_DATA_RATE_0_DR_7_0_MIN                               0
#define SI446X_PROP_MODEM_DATA_RATE_0_DR_7_0_MAX                               255
#define SI446X_PROP_MODEM_DATA_RATE_0_DR_7_0_MASK                              0xFF





#define SI446X_PROP_MODEM_FREQ_DEV_2_MASK                                      0xFF
#define SI446X_PROP_MODEM_FREQ_DEV_2_DEFAULT                                   0x00
#define SI446X_PROP_MODEM_FREQ_DEV_2_FREQDEV_16_SIZE                           1
#define SI446X_PROP_MODEM_FREQ_DEV_2_FREQDEV_16_LSB                            0
#define SI446X_PROP_MODEM_FREQ_DEV_2_FREQDEV_16_MSB                            0
#define SI446X_PROP_MODEM_FREQ_DEV_2_FREQDEV_16_MASK                           0x1
#define SI446X_PROP_MODEM_FREQ_DEV_2_FREQDEV_16_BIT                            0x1

#define SI446X_PROP_MODEM_FREQ_DEV_1_MASK                                      0xFF
#define SI446X_PROP_MODEM_FREQ_DEV_1_DEFAULT                                   0x06
#define SI446X_PROP_MODEM_FREQ_DEV_1_FREQDEV_15_8_SIZE                         8
#define SI446X_PROP_MODEM_FREQ_DEV_1_FREQDEV_15_8_LSB                          0
#define SI446X_PROP_MODEM_FREQ_DEV_1_FREQDEV_15_8_MSB                          7
#define SI446X_PROP_MODEM_FREQ_DEV_1_FREQDEV_15_8_MIN                          0
#define SI446X_PROP_MODEM_FREQ_DEV_1_FREQDEV_15_8_MAX                          255
#define SI446X_PROP_MODEM_FREQ_DEV_1_FREQDEV_15_8_MASK                         0xFF

#define SI446X_PROP_MODEM_FREQ_DEV_0_MASK                                      0xFF
#define SI446X_PROP_MODEM_FREQ_DEV_0_DEFAULT                                   0xD3
#define SI446X_PROP_MODEM_FREQ_DEV_0_FREQDEV_7_0_SIZE                          8
#define SI446X_PROP_MODEM_FREQ_DEV_0_FREQDEV_7_0_LSB                           0
#define SI446X_PROP_MODEM_FREQ_DEV_0_FREQDEV_7_0_MSB                           7
#define SI446X_PROP_MODEM_FREQ_DEV_0_FREQDEV_7_0_MIN                           0
#define SI446X_PROP_MODEM_FREQ_DEV_0_FREQDEV_7_0_MAX                           255
#define SI446X_PROP_MODEM_FREQ_DEV_0_FREQDEV_7_0_MASK                          0xFF

#define SI446X_PROP_MODEM_FREQ_OFFSET_1_MASK                                   0xFF
#define SI446X_PROP_MODEM_FREQ_OFFSET_1_DEFAULT                                0x00
#define SI446X_PROP_MODEM_FREQ_OFFSET_1_FREQOFFSET_15_8_SIZE                   8
#define SI446X_PROP_MODEM_FREQ_OFFSET_1_FREQOFFSET_15_8_LSB                    0
#define SI446X_PROP_MODEM_FREQ_OFFSET_1_FREQOFFSET_15_8_MSB                    7
#define SI446X_PROP_MODEM_FREQ_OFFSET_1_FREQOFFSET_15_8_MASK                   0xFF

#define SI446X_PROP_MODEM_FREQ_OFFSET_0_MASK                                   0xFF
#define SI446X_PROP_MODEM_FREQ_OFFSET_0_DEFAULT                                0x00
#define SI446X_PROP_MODEM_FREQ_OFFSET_0_FREQOFFSET_7_0_SIZE                    8
#define SI446X_PROP_MODEM_FREQ_OFFSET_0_FREQOFFSET_7_0_LSB                     0
#define SI446X_PROP_MODEM_FREQ_OFFSET_0_FREQOFFSET_7_0_MSB                     7
#define SI446X_PROP_MODEM_FREQ_OFFSET_0_FREQOFFSET_7_0_MASK                    0xFF






























#define SI446X_PROP_MODEM_AFC_GEAR_MASK                                        0xFF
#define SI446X_PROP_MODEM_AFC_GEAR_DEFAULT                                     0x00
#define SI446X_PROP_MODEM_AFC_GEAR_GEAR_SW_SIZE                                2
#define SI446X_PROP_MODEM_AFC_GEAR_GEAR_SW_LSB                                 6
#define SI446X_PROP_MODEM_AFC_GEAR_GEAR_SW_MSB                                 7
#define SI446X_PROP_MODEM_AFC_GEAR_GEAR_SW_MASK                                0xC0
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_FAST_SIZE                               3
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_FAST_LSB                                3
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_FAST_MSB                                5
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_FAST_MASK                               0x38
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_SLOW_SIZE                               3
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_SLOW_LSB                                0
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_SLOW_MSB                                2
#define SI446X_PROP_MODEM_AFC_GEAR_AFC_SLOW_MASK                               0x7

#define SI446X_PROP_MODEM_AFC_WAIT_MASK                                        0xFF
#define SI446X_PROP_MODEM_AFC_WAIT_DEFAULT                                     0x23
#define SI446X_PROP_MODEM_AFC_WAIT_SHWAIT_SIZE                                 4
#define SI446X_PROP_MODEM_AFC_WAIT_SHWAIT_LSB                                  4
#define SI446X_PROP_MODEM_AFC_WAIT_SHWAIT_MSB                                  7
#define SI446X_PROP_MODEM_AFC_WAIT_SHWAIT_MASK                                 0xF0
#define SI446X_PROP_MODEM_AFC_WAIT_LGWAIT_SIZE                                 4
#define SI446X_PROP_MODEM_AFC_WAIT_LGWAIT_LSB                                  0
#define SI446X_PROP_MODEM_AFC_WAIT_LGWAIT_MSB                                  3
#define SI446X_PROP_MODEM_AFC_WAIT_LGWAIT_MASK                                 0xF

