hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_MODEM_AFC_GAIN_1_MASK                                      0xFF
#define SI446X_PROP_MODEM_AFC_GAIN_1_DEFAULT                                   0x83
#define SI446X_PROP_MODEM_AFC_GAIN_1_ENAFC_SIZE                                1
#define SI446X_PROP_MODEM_AFC_GAIN_1_ENAFC_LSB                                 7
#define SI446X_PROP_MODEM_AFC_GAIN_1_ENAFC_MSB                                 7
#define SI446X_PROP_MODEM_AFC_GAIN_1_ENAFC_MASK                                0x80
#define SI446X_PROP_MODEM_AFC_GAIN_1_ENAFC_BIT                                 0x80
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCBD_SIZE                                1
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCBD_LSB                                 6
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCBD_MSB                                 6
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCBD_MASK                                0x40
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCBD_BIT                                 0x40
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCGAIN_12_8_SIZE                         5
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCGAIN_12_8_LSB                          0
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCGAIN_12_8_MSB                          4
#define SI446X_PROP_MODEM_AFC_GAIN_1_AFCGAIN_12_8_MASK                         0x1F

#define SI446X_PROP_MODEM_AFC_GAIN_0_MASK                                      0xFF
#define SI446X_PROP_MODEM_AFC_GAIN_0_DEFAULT                                   0x69
#define SI446X_PROP_MODEM_AFC_GAIN_0_AFCGAIN_7_0_SIZE                          8
#define SI446X_PROP_MODEM_AFC_GAIN_0_AFCGAIN_7_0_LSB                           0
#define SI446X_PROP_MODEM_AFC_GAIN_0_AFCGAIN_7_0_MSB                           7
#define SI446X_PROP_MODEM_AFC_GAIN_0_AFCGAIN_7_0_MASK                          0xFF

#define SI446X_PROP_MODEM_AFC_LIMITER_1_MASK                                   0xFF
#define SI446X_PROP_MODEM_AFC_LIMITER_1_DEFAULT                                0x00
#define SI446X_PROP_MODEM_AFC_LIMITER_1_AFCLIM_14_8_SIZE                       7
#define SI446X_PROP_MODEM_AFC_LIMITER_1_AFCLIM_14_8_LSB                        0
#define SI446X_PROP_MODEM_AFC_LIMITER_1_AFCLIM_14_8_MSB                        6
#define SI446X_PROP_MODEM_AFC_LIMITER_1_AFCLIM_14_8_MASK                       0x7F

#define SI446X_PROP_MODEM_AFC_LIMITER_0_MASK                                   0xFF
#define SI446X_PROP_MODEM_AFC_LIMITER_0_DEFAULT                                0x40
#define SI446X_PROP_MODEM_AFC_LIMITER_0_AFCLIM_7_0_SIZE                        8
#define SI446X_PROP_MODEM_AFC_LIMITER_0_AFCLIM_7_0_LSB                         0
#define SI446X_PROP_MODEM_AFC_LIMITER_0_AFCLIM_7_0_MSB                         7
#define SI446X_PROP_MODEM_AFC_LIMITER_0_AFCLIM_7_0_MASK                        0xFF

#define SI446X_PROP_MODEM_AFC_MISC_MASK                                        0xFF
#define SI446X_PROP_MODEM_AFC_MISC_DEFAULT                                     0xA0
#define SI446X_PROP_MODEM_AFC_MISC_ENAFCFRZ_SIZE                               1
#define SI446X_PROP_MODEM_AFC_MISC_ENAFCFRZ_LSB                                7
#define SI446X_PROP_MODEM_AFC_MISC_ENAFCFRZ_MSB                                7
#define SI446X_PROP_MODEM_AFC_MISC_ENAFCFRZ_MASK                               0x80
#define SI446X_PROP_MODEM_AFC_MISC_ENAFCFRZ_BIT                                0x80
#define SI446X_PROP_MODEM_AFC_MISC_ENFBPLL_SIZE                                1
#define SI446X_PROP_MODEM_AFC_MISC_ENFBPLL_LSB                                 6
#define SI446X_PROP_MODEM_AFC_MISC_ENFBPLL_MSB                                 6
#define SI446X_PROP_MODEM_AFC_MISC_ENFBPLL_MASK                                0x40
#define SI446X_PROP_MODEM_AFC_MISC_ENFBPLL_BIT                                 0x40
#define SI446X_PROP_MODEM_AFC_MISC_EN2TB_EST_SIZE                              1
#define SI446X_PROP_MODEM_AFC_MISC_EN2TB_EST_LSB                               5
#define SI446X_PROP_MODEM_AFC_MISC_EN2TB_EST_MSB                               5
#define SI446X_PROP_MODEM_AFC_MISC_EN2TB_EST_MASK                              0x20
#define SI446X_PROP_MODEM_AFC_MISC_EN2TB_EST_BIT                               0x20
#define SI446X_PROP_MODEM_AFC_MISC_ENFZPMEND_SIZE                              1
#define SI446X_PROP_MODEM_AFC_MISC_ENFZPMEND_LSB                               4
#define SI446X_PROP_MODEM_AFC_MISC_ENFZPMEND_MSB                               4
#define SI446X_PROP_MODEM_AFC_MISC_ENFZPMEND_MASK                              0x10
#define SI446X_PROP_MODEM_AFC_MISC_ENFZPMEND_BIT                               0x10
#define SI446X_PROP_MODEM_AFC_MISC_ENAFC_CLKSW_SIZE                            1
#define SI446X_PROP_MODEM_AFC_MISC_ENAFC_CLKSW_LSB                             3
#define SI446X_PROP_MODEM_AFC_MISC_ENAFC_CLKSW_MSB                             3
#define SI446X_PROP_MODEM_AFC_MISC_ENAFC_CLKSW_MASK                            0x8
#define SI446X_PROP_MODEM_AFC_MISC_ENAFC_CLKSW_BIT                             0x8
#define SI446X_PROP_MODEM_AFC_MISC_OOK_ZEROG_SIZE                              1
#define SI446X_PROP_MODEM_AFC_MISC_OOK_ZEROG_LSB                               2
#define SI446X_PROP_MODEM_AFC_MISC_OOK_ZEROG_MSB                               2
#define SI446X_PROP_MODEM_AFC_MISC_OOK_ZEROG_MASK                              0x4
#define SI446X_PROP_MODEM_AFC_MISC_OOK_ZEROG_BIT                               0x4
#define SI446X_PROP_MODEM_AFC_MISC_NON_FRZEN_SIZE                              1
#define SI446X_PROP_MODEM_AFC_MISC_NON_FRZEN_LSB                               1
#define SI446X_PROP_MODEM_AFC_MISC_NON_FRZEN_MSB                               1
#define SI446X_PROP_MODEM_AFC_MISC_NON_FRZEN_MASK                              0x2
#define SI446X_PROP_MODEM_AFC_MISC_NON_FRZEN_BIT                               0x2

#define SI446X_PROP_MODEM_AFC_ZIFOFF_MASK                                      0xFF
#define SI446X_PROP_MODEM_AFC_ZIFOFF_DEFAULT                                   0x00
#define SI446X_PROP_MODEM_AFC_ZIFOFF_ZEROFF_SIZE                               8
#define SI446X_PROP_MODEM_AFC_ZIFOFF_ZEROFF_LSB                                0
#define SI446X_PROP_MODEM_AFC_ZIFOFF_ZEROFF_MSB                                7
#define SI446X_PROP_MODEM_AFC_ZIFOFF_ZEROFF_MASK                               0xFF

#define SI446X_PROP_MODEM_ADC_CTRL_MASK                                        0xFF
#define SI446X_PROP_MODEM_ADC_CTRL_DEFAULT                                     0x00
#define SI446X_PROP_MODEM_ADC_CTRL_HGAIN_SIZE                                  1
#define SI446X_PROP_MODEM_ADC_CTRL_HGAIN_LSB                                   4
#define SI446X_PROP_MODEM_ADC_CTRL_HGAIN_MSB                                   4
#define SI446X_PROP_MODEM_ADC_CTRL_HGAIN_MASK                                  0x10
#define SI446X_PROP_MODEM_ADC_CTRL_HGAIN_BIT                                   0x10
#define SI446X_PROP_MODEM_ADC_CTRL_EN_DRST_SIZE                                1
#define SI446X_PROP_MODEM_ADC_CTRL_EN_DRST_LSB                                 3
#define SI446X_PROP_MODEM_ADC_CTRL_EN_DRST_MSB                                 3
#define SI446X_PROP_MODEM_ADC_CTRL_EN_DRST_MASK                                0x8
#define SI446X_PROP_MODEM_ADC_CTRL_EN_DRST_BIT                                 0x8
#define SI446X_PROP_MODEM_ADC_CTRL_REALADC_SIZE                                1
#define SI446X_PROP_MODEM_ADC_CTRL_REALADC_LSB                                 1
#define SI446X_PROP_MODEM_ADC_CTRL_REALADC_MSB                                 1
#define SI446X_PROP_MODEM_ADC_CTRL_REALADC_MASK                                0x2
#define SI446X_PROP_MODEM_ADC_CTRL_REALADC_BIT                                 0x2





















#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_MASK                                 0xFF
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_DEFAULT                              0x80
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANT2PM_THD_SIZE                      4
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANT2PM_THD_LSB                       4
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANT2PM_THD_MSB                       7
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANT2PM_THD_MASK                      0xF0
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_MATAP_SIZE                           1
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_MATAP_LSB                            3
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_MATAP_MSB                            3
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_MATAP_MASK                           0x8
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_MATAP_BIT                            0x8
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANTDIV_SIZE                          3
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANTDIV_LSB                           0
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANTDIV_MSB                           2
#define SI446X_PROP_MODEM_ANT_DIV_CONTROL_ANTDIV_MASK                          0x7

#define SI446X_PROP_MODEM_RSSI_THRESH_MASK                                     0xFF
#define SI446X_PROP_MODEM_RSSI_THRESH_DEFAULT                                  0xFF
#define SI446X_PROP_MODEM_RSSI_THRESH_RSSI_THRESH_SIZE                         8
#define SI446X_PROP_MODEM_RSSI_THRESH_RSSI_THRESH_LSB                          0
#define SI446X_PROP_MODEM_RSSI_THRESH_RSSI_THRESH_MSB                          7
#define SI446X_PROP_MODEM_RSSI_THRESH_RSSI_THRESH_MIN                          0
#define SI446X_PROP_MODEM_RSSI_THRESH_RSSI_THRESH_MAX                          255
#define SI446X_PROP_MODEM_RSSI_THRESH_RSSI_THRESH_MASK                         0xFF

#define SI446X_PROP_MODEM_RSSI_JUMP_THRESH_MASK                                0xFF
#define SI446X_PROP_MODEM_RSSI_JUMP_THRESH_DEFAULT                             0x0C
#define SI446X_PROP_MODEM_RSSI_JUMP_THRESH_RSSIJMPTHD_SIZE                     7
#define SI446X_PROP_MODEM_RSSI_JUMP_THRESH_RSSIJMPTHD_LSB                      0
#define SI446X_PROP_MODEM_RSSI_JUMP_THRESH_RSSIJMPTHD_MSB                      6
#define SI446X_PROP_MODEM_RSSI_JUMP_THRESH_RSSIJMPTHD_MASK                     0x7F

#define SI446X_PROP_MODEM_RSSI_CONTROL_MASK                                    0xFF
#define SI446X_PROP_MODEM_RSSI_CONTROL_DEFAULT                                 0x01
#define SI446X_PROP_MODEM_RSSI_CONTROL_CHECK_THRESH_AT_LATCH_SIZE              1
#define SI446X_PROP_MODEM_RSSI_CONTROL_CHECK_THRESH_AT_LATCH_LSB               5
#define SI446X_PROP_MODEM_RSSI_CONTROL_CHECK_THRESH_AT_LATCH_MSB               5
#define SI446X_PROP_MODEM_RSSI_CONTROL_CHECK_THRESH_AT_LATCH_MASK              0x20
#define SI446X_PROP_MODEM_RSSI_CONTROL_CHECK_THRESH_AT_LATCH_BIT               0x20
#define SI446X_PROP_MODEM_RSSI_CONTROL_CHECK_THRESH_AT_LATCH_ENUM_DISABLE      0
#define SI446X_PROP_MODEM_RSSI_CONTROL_CHECK_THRESH_AT_LATCH_ENUM_ENABLE       1
#define SI446X_PROP_MODEM_RSSI_CONTROL_AVERAGE_SIZE                            1
#define SI446X_PROP_MODEM_RSSI_CONTROL_AVERAGE_LSB                             4
#define SI446X_PROP_MODEM_RSSI_CONTROL_AVERAGE_MSB                             4
#define SI446X_PROP_MODEM_RSSI_CONTROL_AVERAGE_MASK                            0x10
#define SI446X_PROP_MODEM_RSSI_CONTROL_AVERAGE_BIT                             0x10
#define SI446X_PROP_MODEM_RSSI_CONTROL_AVERAGE_ENUM_AVERAGE4                   0
#define SI446X_PROP_MODEM_RSSI_CONTROL_AVERAGE_ENUM_AVERAGE1                   1
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_SIZE                              3
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_LSB                               0
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_MSB                               2
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_MASK                              0x7
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_DISABLED                     0
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_PREAMBLE                     1
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_SYNC                         2
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_RX_STATE1                    3
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_RX_STATE2                    4
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_RX_STATE3                    5
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_RX_STATE4                    6
#define SI446X_PROP_MODEM_RSSI_CONTROL_LATCH_ENUM_RX_STATE5                    7

