hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_MODEM_RSSI_CONTROL2_MASK                                   0xFF
#define SI446X_PROP_MODEM_RSSI_CONTROL2_DEFAULT                                0x00
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_DWN_SIZE                       1
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_DWN_LSB                        5
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_DWN_MSB                        5
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_DWN_MASK                       0x20
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_DWN_BIT                        0x20
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_UP_SIZE                        1
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_UP_LSB                         4
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_UP_MSB                         4
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_UP_MASK                        0x10
#define SI446X_PROP_MODEM_RSSI_CONTROL2_RSSIJMP_UP_BIT                         0x10
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENRSSIJMP_SIZE                         1
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENRSSIJMP_LSB                          3
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENRSSIJMP_MSB                          3
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENRSSIJMP_MASK                         0x8
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENRSSIJMP_BIT                          0x8
#define SI446X_PROP_MODEM_RSSI_CONTROL2_JMPDLYLEN_SIZE                         1
#define SI446X_PROP_MODEM_RSSI_CONTROL2_JMPDLYLEN_LSB                          2
#define SI446X_PROP_MODEM_RSSI_CONTROL2_JMPDLYLEN_MSB                          2
#define SI446X_PROP_MODEM_RSSI_CONTROL2_JMPDLYLEN_MASK                         0x4
#define SI446X_PROP_MODEM_RSSI_CONTROL2_JMPDLYLEN_BIT                          0x4
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENJMPRX_SIZE                           1
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENJMPRX_LSB                            1
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENJMPRX_MSB                            1
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENJMPRX_MASK                           0x2
#define SI446X_PROP_MODEM_RSSI_CONTROL2_ENJMPRX_BIT                            0x2

#define SI446X_PROP_MODEM_RSSI_COMP_MASK                                       0xFF
#define SI446X_PROP_MODEM_RSSI_COMP_DEFAULT                                    0x32
#define SI446X_PROP_MODEM_RSSI_COMP_RSSI_COMP_SIZE                             7
#define SI446X_PROP_MODEM_RSSI_COMP_RSSI_COMP_LSB                              0
#define SI446X_PROP_MODEM_RSSI_COMP_RSSI_COMP_MSB                              6
#define SI446X_PROP_MODEM_RSSI_COMP_RSSI_COMP_MIN                              0
#define SI446X_PROP_MODEM_RSSI_COMP_RSSI_COMP_MAX                              127
#define SI446X_PROP_MODEM_RSSI_COMP_RSSI_COMP_MASK                             0x7F


#define SI446X_PROP_MODEM_OOKZEROIF_RB_0_MASK                                  0xFF
#define SI446X_PROP_MODEM_OOKZEROIF_RB_0_DEFAULT                               0x00
#define SI446X_PROP_MODEM_OOKZEROIF_RB_0_RB_7_0_SIZE                           8
#define SI446X_PROP_MODEM_OOKZEROIF_RB_0_RB_7_0_LSB                            0
#define SI446X_PROP_MODEM_OOKZEROIF_RB_0_RB_7_0_MSB                            7
#define SI446X_PROP_MODEM_OOKZEROIF_RB_0_RB_7_0_MASK                           0xFF




#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE13_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE13_7_0_DEFAULT                    0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE13_7_0_RX1_CHFLT_COE13_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE13_7_0_RX1_CHFLT_COE13_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE13_7_0_RX1_CHFLT_COE13_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE13_7_0_RX1_CHFLT_COE13_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE12_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE12_7_0_DEFAULT                    0xBA
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE12_7_0_RX1_CHFLT_COE12_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE12_7_0_RX1_CHFLT_COE12_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE12_7_0_RX1_CHFLT_COE12_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE12_7_0_RX1_CHFLT_COE12_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE11_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE11_7_0_DEFAULT                    0x0F
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE11_7_0_RX1_CHFLT_COE11_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE11_7_0_RX1_CHFLT_COE11_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE11_7_0_RX1_CHFLT_COE11_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE11_7_0_RX1_CHFLT_COE11_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE10_7_0_MASK                       0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE10_7_0_DEFAULT                    0x51
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE10_7_0_RX1_CHFLT_COE10_7_0_SIZE   8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE10_7_0_RX1_CHFLT_COE10_7_0_LSB    0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE10_7_0_RX1_CHFLT_COE10_7_0_MSB    7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE10_7_0_RX1_CHFLT_COE10_7_0_MASK   0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE9_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE9_7_0_DEFAULT                     0xCF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE9_7_0_RX1_CHFLT_COE9_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE9_7_0_RX1_CHFLT_COE9_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE9_7_0_RX1_CHFLT_COE9_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE9_7_0_RX1_CHFLT_COE9_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE8_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE8_7_0_DEFAULT                     0xA9
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE8_7_0_RX1_CHFLT_COE8_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE8_7_0_RX1_CHFLT_COE8_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE8_7_0_RX1_CHFLT_COE8_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE8_7_0_RX1_CHFLT_COE8_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE7_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE7_7_0_DEFAULT                     0xC9
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE7_7_0_RX1_CHFLT_COE7_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE7_7_0_RX1_CHFLT_COE7_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE7_7_0_RX1_CHFLT_COE7_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX1_CHFLT_COE7_7_0_RX1_CHFLT_COE7_7_0_MASK     0xFF

