hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE1_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE1_7_0_DEFAULT                     0x03
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE1_7_0_RX2_CHFLT_COE1_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE1_7_0_RX2_CHFLT_COE1_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE1_7_0_RX2_CHFLT_COE1_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE1_7_0_RX2_CHFLT_COE1_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE0_7_0_MASK                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE0_7_0_DEFAULT                     0x00
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE0_7_0_RX2_CHFLT_COE0_7_0_SIZE     8
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE0_7_0_RX2_CHFLT_COE0_7_0_LSB      0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE0_7_0_RX2_CHFLT_COE0_7_0_MSB      7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COE0_7_0_RX2_CHFLT_COE0_7_0_MASK     0xFF

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_DEFAULT                        0x15
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE10_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE10_9_8_LSB               6
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE10_9_8_MSB               7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE10_9_8_MASK              0xC0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE11_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE11_9_8_LSB               4
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE11_9_8_MSB               5
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE11_9_8_MASK              0x30
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE12_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE12_9_8_LSB               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE12_9_8_MSB               3
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE12_9_8_MASK              0xC
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE13_9_8_SIZE              2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE13_9_8_LSB               0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE13_9_8_MSB               1
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM0_RX2COE13_9_8_MASK              0x3

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_DEFAULT                        0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE6_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE6_9_8_LSB                6
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE6_9_8_MSB                7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE6_9_8_MASK               0xC0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE7_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE7_9_8_LSB                4
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE7_9_8_MSB                5
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE7_9_8_MASK               0x30
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE8_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE8_9_8_LSB                2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE8_9_8_MSB                3
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE8_9_8_MASK               0xC
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE9_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE9_9_8_LSB                0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE9_9_8_MSB                1
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM1_RX2COE9_9_8_MASK               0x3

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_DEFAULT                        0x00
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE2_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE2_9_8_LSB                6
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE2_9_8_MSB                7
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE2_9_8_MASK               0xC0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE3_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE3_9_8_LSB                4
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE3_9_8_MSB                5
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE3_9_8_MASK               0x30
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE4_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE4_9_8_LSB                2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE4_9_8_MSB                3
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE4_9_8_MASK               0xC
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE5_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE5_9_8_LSB                0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE5_9_8_MSB                1
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM2_RX2COE5_9_8_MASK               0x3

#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_MASK                           0xFF
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_DEFAULT                        0x00
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE0_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE0_9_8_LSB                2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE0_9_8_MSB                3
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE0_9_8_MASK               0xC
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE1_9_8_SIZE               2
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE1_9_8_LSB                0
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE1_9_8_MSB                1
#define SI446X_PROP_MODEM_CHFLT_RX2_CHFLT_COEM3_RX2COE1_9_8_MASK               0x3


#define SI446X_PROP_PA_PWR_LVL_MASK                                            0xFF
#define SI446X_PROP_PA_PWR_LVL_DEFAULT                                         0x7F
#define SI446X_PROP_PA_PWR_LVL_DDAC_SIZE                                       7
#define SI446X_PROP_PA_PWR_LVL_DDAC_LSB                                        0
#define SI446X_PROP_PA_PWR_LVL_DDAC_MSB                                        6
#define SI446X_PROP_PA_PWR_LVL_DDAC_MIN                                        0
#define SI446X_PROP_PA_PWR_LVL_DDAC_MAX                                        127
#define SI446X_PROP_PA_PWR_LVL_DDAC_MASK                                       0x7F

#define SI446X_PROP_PA_BIAS_CLKDUTY_MASK                                       0xFF
#define SI446X_PROP_PA_BIAS_CLKDUTY_DEFAULT                                    0x00
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_SIZE                              2
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_LSB                               6
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_MSB                               7
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_MASK                              0xC0
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_DIFF_50                      0
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_DIFF_25                      1
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_SINGLE_50                    2
#define SI446X_PROP_PA_BIAS_CLKDUTY_CLK_DUTY_ENUM_SINGLE_25                    3
#define SI446X_PROP_PA_BIAS_CLKDUTY_OB_SIZE                                    6
#define SI446X_PROP_PA_BIAS_CLKDUTY_OB_LSB                                     0
#define SI446X_PROP_PA_BIAS_CLKDUTY_OB_MSB                                     5
#define SI446X_PROP_PA_BIAS_CLKDUTY_OB_MIN                                     0
#define SI446X_PROP_PA_BIAS_CLKDUTY_OB_MAX                                     63
#define SI446X_PROP_PA_BIAS_CLKDUTY_OB_MASK                                    0x3F

