hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_MATCH_MASK_2_MASK                                          0xFF
#define SI446X_PROP_MATCH_MASK_2_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_MASK_2_MASK_2_SIZE                                   8
#define SI446X_PROP_MATCH_MASK_2_MASK_2_LSB                                    0
#define SI446X_PROP_MATCH_MASK_2_MASK_2_MSB                                    7
#define SI446X_PROP_MATCH_MASK_2_MASK_2_MIN                                    0
#define SI446X_PROP_MATCH_MASK_2_MASK_2_MAX                                    0xFF
#define SI446X_PROP_MATCH_MASK_2_MASK_2_MASK                                   0xFF

#define SI446X_PROP_MATCH_CTRL_2_MASK                                          0xFF
#define SI446X_PROP_MATCH_CTRL_2_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_CTRL_2_POLARITY_SIZE                                 1
#define SI446X_PROP_MATCH_CTRL_2_POLARITY_LSB                                  7
#define SI446X_PROP_MATCH_CTRL_2_POLARITY_MSB                                  7
#define SI446X_PROP_MATCH_CTRL_2_POLARITY_MASK                                 0x80
#define SI446X_PROP_MATCH_CTRL_2_POLARITY_BIT                                  0x80
#define SI446X_PROP_MATCH_CTRL_2_LOGIC_SIZE                                    1
#define SI446X_PROP_MATCH_CTRL_2_LOGIC_LSB                                     6
#define SI446X_PROP_MATCH_CTRL_2_LOGIC_MSB                                     6
#define SI446X_PROP_MATCH_CTRL_2_LOGIC_MASK                                    0x40
#define SI446X_PROP_MATCH_CTRL_2_LOGIC_BIT                                     0x40
#define SI446X_PROP_MATCH_CTRL_2_OFFSET_SIZE                                   5
#define SI446X_PROP_MATCH_CTRL_2_OFFSET_LSB                                    0
#define SI446X_PROP_MATCH_CTRL_2_OFFSET_MSB                                    4
#define SI446X_PROP_MATCH_CTRL_2_OFFSET_MIN                                    0
#define SI446X_PROP_MATCH_CTRL_2_OFFSET_MAX                                    0x1F
#define SI446X_PROP_MATCH_CTRL_2_OFFSET_MASK                                   0x1F

#define SI446X_PROP_MATCH_VALUE_3_MASK                                         0xFF
#define SI446X_PROP_MATCH_VALUE_3_DEFAULT                                      0x00
#define SI446X_PROP_MATCH_VALUE_3_VALUE_3_SIZE                                 8
#define SI446X_PROP_MATCH_VALUE_3_VALUE_3_LSB                                  0
#define SI446X_PROP_MATCH_VALUE_3_VALUE_3_MSB                                  7
#define SI446X_PROP_MATCH_VALUE_3_VALUE_3_MIN                                  0
#define SI446X_PROP_MATCH_VALUE_3_VALUE_3_MAX                                  0xFF
#define SI446X_PROP_MATCH_VALUE_3_VALUE_3_MASK                                 0xFF

#define SI446X_PROP_MATCH_MASK_3_MASK                                          0xFF
#define SI446X_PROP_MATCH_MASK_3_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_MASK_3_MASK_3_SIZE                                   8
#define SI446X_PROP_MATCH_MASK_3_MASK_3_LSB                                    0
#define SI446X_PROP_MATCH_MASK_3_MASK_3_MSB                                    7
#define SI446X_PROP_MATCH_MASK_3_MASK_3_MIN                                    0
#define SI446X_PROP_MATCH_MASK_3_MASK_3_MAX                                    0xFF
#define SI446X_PROP_MATCH_MASK_3_MASK_3_MASK                                   0xFF

#define SI446X_PROP_MATCH_CTRL_3_MASK                                          0xFF
#define SI446X_PROP_MATCH_CTRL_3_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_CTRL_3_POLARITY_SIZE                                 1
#define SI446X_PROP_MATCH_CTRL_3_POLARITY_LSB                                  7
#define SI446X_PROP_MATCH_CTRL_3_POLARITY_MSB                                  7
#define SI446X_PROP_MATCH_CTRL_3_POLARITY_MASK                                 0x80
#define SI446X_PROP_MATCH_CTRL_3_POLARITY_BIT                                  0x80
#define SI446X_PROP_MATCH_CTRL_3_LOGIC_SIZE                                    1
#define SI446X_PROP_MATCH_CTRL_3_LOGIC_LSB                                     6
#define SI446X_PROP_MATCH_CTRL_3_LOGIC_MSB                                     6
#define SI446X_PROP_MATCH_CTRL_3_LOGIC_MASK                                    0x40
#define SI446X_PROP_MATCH_CTRL_3_LOGIC_BIT                                     0x40
#define SI446X_PROP_MATCH_CTRL_3_OFFSET_SIZE                                   5
#define SI446X_PROP_MATCH_CTRL_3_OFFSET_LSB                                    0
#define SI446X_PROP_MATCH_CTRL_3_OFFSET_MSB                                    4
#define SI446X_PROP_MATCH_CTRL_3_OFFSET_MIN                                    0
#define SI446X_PROP_MATCH_CTRL_3_OFFSET_MAX                                    0x1F
#define SI446X_PROP_MATCH_CTRL_3_OFFSET_MASK                                   0x1F

#define SI446X_PROP_MATCH_VALUE_4_MASK                                         0xFF
#define SI446X_PROP_MATCH_VALUE_4_DEFAULT                                      0x00
#define SI446X_PROP_MATCH_VALUE_4_VALUE_4_SIZE                                 8
#define SI446X_PROP_MATCH_VALUE_4_VALUE_4_LSB                                  0
#define SI446X_PROP_MATCH_VALUE_4_VALUE_4_MSB                                  7
#define SI446X_PROP_MATCH_VALUE_4_VALUE_4_MIN                                  0
#define SI446X_PROP_MATCH_VALUE_4_VALUE_4_MAX                                  0xFF
#define SI446X_PROP_MATCH_VALUE_4_VALUE_4_MASK                                 0xFF

#define SI446X_PROP_MATCH_MASK_4_MASK                                          0xFF
#define SI446X_PROP_MATCH_MASK_4_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_MASK_4_MASK_4_SIZE                                   8
#define SI446X_PROP_MATCH_MASK_4_MASK_4_LSB                                    0
#define SI446X_PROP_MATCH_MASK_4_MASK_4_MSB                                    7
#define SI446X_PROP_MATCH_MASK_4_MASK_4_MIN                                    0
#define SI446X_PROP_MATCH_MASK_4_MASK_4_MAX                                    0xFF
#define SI446X_PROP_MATCH_MASK_4_MASK_4_MASK                                   0xFF

#define SI446X_PROP_MATCH_CTRL_4_MASK                                          0xFF
#define SI446X_PROP_MATCH_CTRL_4_DEFAULT                                       0x00
#define SI446X_PROP_MATCH_CTRL_4_POLARITY_SIZE                                 1
#define SI446X_PROP_MATCH_CTRL_4_POLARITY_LSB                                  7
#define SI446X_PROP_MATCH_CTRL_4_POLARITY_MSB                                  7
#define SI446X_PROP_MATCH_CTRL_4_POLARITY_MASK                                 0x80
#define SI446X_PROP_MATCH_CTRL_4_POLARITY_BIT                                  0x80
#define SI446X_PROP_MATCH_CTRL_4_LOGIC_SIZE                                    1
#define SI446X_PROP_MATCH_CTRL_4_LOGIC_LSB                                     6
#define SI446X_PROP_MATCH_CTRL_4_LOGIC_MSB                                     6
#define SI446X_PROP_MATCH_CTRL_4_LOGIC_MASK                                    0x40
#define SI446X_PROP_MATCH_CTRL_4_LOGIC_BIT                                     0x40
#define SI446X_PROP_MATCH_CTRL_4_OFFSET_SIZE                                   5
#define SI446X_PROP_MATCH_CTRL_4_OFFSET_LSB                                    0
#define SI446X_PROP_MATCH_CTRL_4_OFFSET_MSB                                    4
#define SI446X_PROP_MATCH_CTRL_4_OFFSET_MIN                                    0
#define SI446X_PROP_MATCH_CTRL_4_OFFSET_MAX                                    0x1F
#define SI446X_PROP_MATCH_CTRL_4_OFFSET_MASK                                   0x1F

#define SI446X_PROP_FREQ_CONTROL_INTE_MASK                                     0xFF
#define SI446X_PROP_FREQ_CONTROL_INTE_DEFAULT                                  0x3C
#define SI446X_PROP_FREQ_CONTROL_INTE_INTE_SIZE                                7
#define SI446X_PROP_FREQ_CONTROL_INTE_INTE_LSB                                 0
#define SI446X_PROP_FREQ_CONTROL_INTE_INTE_MSB                                 6
#define SI446X_PROP_FREQ_CONTROL_INTE_INTE_MIN                                 0
#define SI446X_PROP_FREQ_CONTROL_INTE_INTE_MAX                                 127
#define SI446X_PROP_FREQ_CONTROL_INTE_INTE_MASK                                0x7F

#define SI446X_PROP_FREQ_CONTROL_FRAC_2_MASK                                   0xFF
#define SI446X_PROP_FREQ_CONTROL_FRAC_2_DEFAULT                                0x08
#define SI446X_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_SIZE                            3
#define SI446X_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_LSB                             0
#define SI446X_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MSB                             2
#define SI446X_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MIN                             0
#define SI446X_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MAX                             7
#define SI446X_PROP_FREQ_CONTROL_FRAC_2_FRAC_2_MASK                            0x7

