hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_MASK                                   0xFF
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_DEFAULT                                0x00
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_SIZE                            8
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_LSB                             0
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MSB                             7
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MIN                             0
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MAX                             255
#define SI446X_PROP_FREQ_CONTROL_FRAC_1_FRAC_1_MASK                            0xFF

#define SI446X_PROP_FREQ_CONTROL_FRAC_0_MASK                                   0xFF
#define SI446X_PROP_FREQ_CONTROL_FRAC_0_DEFAULT                                0x00
#define SI446X_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_SIZE                            8
#define SI446X_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_LSB                             0
#define SI446X_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MSB                             7
#define SI446X_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MIN                             0
#define SI446X_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MAX                             255
#define SI446X_PROP_FREQ_CONTROL_FRAC_0_FRAC_0_MASK                            0xFF

#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_MASK                      0xFF
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_DEFAULT                   0x00
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_SIZE  8
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_LSB   0
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MSB   7
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MIN   0
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MAX   255
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_1_CHANNEL_STEP_SIZE_1_MASK  0xFF

#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_MASK                      0xFF
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_DEFAULT                   0x00
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_SIZE  8
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_LSB   0
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MSB   7
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MIN   0
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MAX   255
#define SI446X_PROP_FREQ_CONTROL_CHANNEL_STEP_SIZE_0_CHANNEL_STEP_SIZE_0_MASK  0xFF

#define SI446X_PROP_FREQ_CONTROL_W_SIZE_MASK                                   0xFF
#define SI446X_PROP_FREQ_CONTROL_W_SIZE_DEFAULT                                0x20
#define SI446X_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_SIZE                            8
#define SI446X_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_LSB                             0
#define SI446X_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MSB                             7
#define SI446X_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MIN                             0
#define SI446X_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MAX                             255
#define SI446X_PROP_FREQ_CONTROL_W_SIZE_W_SIZE_MASK                            0xFF

#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_MASK                            0xFF
#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_DEFAULT                         0xFF
#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_SIZE              8
#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_LSB               0
#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MSB               7
#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MIN               -128
#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MAX               127
#define SI446X_PROP_FREQ_CONTROL_VCOCNT_RX_ADJ_VCOCNT_RX_ADJ_MASK              0xFF

#define SI446X_PROP_RX_HOP_CONTROL_MASK                                        0xFF
#define SI446X_PROP_RX_HOP_CONTROL_DEFAULT                                     0x04
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_SIZE                                 3
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_LSB                                  4
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_MSB                                  6
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_MASK                                 0x70
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_ENUM_HOP_DISABLE                     0
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_ENUM_HOP_PM_TO                       1
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_ENUM_HOP_RSSI_PM_TO                  2
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_ENUM_HOP_PM_SYNC_TO                  3
#define SI446X_PROP_RX_HOP_CONTROL_HOP_EN_ENUM_HOP_RSSI_PM_SYNC_TO             4
#define SI446X_PROP_RX_HOP_CONTROL_RSSI_TIMEOUT_SIZE                           4
#define SI446X_PROP_RX_HOP_CONTROL_RSSI_TIMEOUT_LSB                            0
#define SI446X_PROP_RX_HOP_CONTROL_RSSI_TIMEOUT_MSB                            3
#define SI446X_PROP_RX_HOP_CONTROL_RSSI_TIMEOUT_MASK                           0xF

#define SI446X_PROP_RX_HOP_TABLE_SIZE_MASK                                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_SIZE_DEFAULT                                  0x01
#define SI446X_PROP_RX_HOP_TABLE_SIZE_RX_HOP_TABLE_SIZE_SIZE                   7
#define SI446X_PROP_RX_HOP_TABLE_SIZE_RX_HOP_TABLE_SIZE_LSB                    0
#define SI446X_PROP_RX_HOP_TABLE_SIZE_RX_HOP_TABLE_SIZE_MSB                    6
#define SI446X_PROP_RX_HOP_TABLE_SIZE_RX_HOP_TABLE_SIZE_MIN                    1
#define SI446X_PROP_RX_HOP_TABLE_SIZE_RX_HOP_TABLE_SIZE_MAX                    64
#define SI446X_PROP_RX_HOP_TABLE_SIZE_RX_HOP_TABLE_SIZE_MASK                   0x7F

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_DEFAULT                               0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_0_CHANNEL_NUM_ENUM_INVALID              255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_MASK                                  0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_DEFAULT                               1
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_CHANNEL_NUM_SIZE                      8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_CHANNEL_NUM_LSB                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_CHANNEL_NUM_MSB                       7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_CHANNEL_NUM_MIN                       0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_CHANNEL_NUM_MAX                       255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_CHANNEL_NUM_MASK                      0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_1_CHANNEL_NUM_ENUM_INVALID              255

