hrshygoodness/EFM32-Library/v2/an/an0817_efm32_with_si446x/radio_drivers/radio/Si446x/si446x_defs.h
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_DEFAULT                              36
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_36_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_DEFAULT                              37
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_37_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_DEFAULT                              38
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_38_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_DEFAULT                              39
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_39_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_DEFAULT                              40
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_40_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_DEFAULT                              41
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_41_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_DEFAULT                              42
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_42_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_DEFAULT                              43
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_43_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_DEFAULT                              44
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_44_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_DEFAULT                              45
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_45_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_DEFAULT                              46
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_46_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_DEFAULT                              47
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_47_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_DEFAULT                              48
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_48_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_DEFAULT                              49
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_49_CHANNEL_NUM_ENUM_INVALID             255

#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_MASK                                 0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_DEFAULT                              50
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_SIZE                     8
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_LSB                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MSB                      7
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MIN                      0
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MAX                      255
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_MASK                     0xFF
#define SI446X_PROP_RX_HOP_TABLE_ENTRY_50_CHANNEL_NUM_ENUM_INVALID             255

